xively/xively-client-c/examples/cc3200/xively_demo/main.c
    // Restore configuration for LED control
    PinTypeGPIO( PIN_01, PIN_MODE_0, false );
    GPIODirModeSet( GPIOA1_BASE, 0x4, GPIO_DIR_MODE_OUT );

    PinTypeGPIO( PIN_02, PIN_MODE_0, false );
    GPIODirModeSet( GPIOA1_BASE, 0x8, GPIO_DIR_MODE_OUT );
}

/**
 * @brief Handler function for eventa related to changes in connection state.
 *
 * @note for more details please refer to xively.h - xi_connect function.
 *
 * @param context_handle - xively library context required for calling API functions
 * @param data - points to the structure that holds detailed information about the
 * connection state and settings
 * @param - state additional internal state of the library helps to determine the reason
 * of connection failure or disconnection
 */
void on_connected( xi_context_handle_t in_context_handle, void* data, xi_state_t state )
{
    xi_connection_data_t* conn_data = ( xi_connection_data_t* )data;

    switch ( conn_data->connection_state )
    {
        case XI_CONNECTION_STATE_OPEN_FAILED:
            UART_PRINT( "connection to %s:%d has failed reason %d\n", conn_data->host,
                        conn_data->port, state );

            xi_connect_to( in_context_handle, conn_data->host, conn_data->port,
                           conn_data->username, conn_data->password,
                           conn_data->connection_timeout, conn_data->keepalive_timeout,
                           conn_data->session_type, &on_connected );

            return;
        case XI_CONNECTION_STATE_OPENED:
            UART_PRINT( "connected to %s:%d\n", conn_data->host, conn_data->port );

            /* register a function to be called periodically */
            gSendTempratureHandle =
                xi_schedule_timed_task( in_context_handle, send_temprature, 5, 1, NULL );

            if ( XI_INVALID_TIMED_TASK_HANDLE == gSendTempratureHandle )
            {
                UART_PRINT( "send_temprature_task couldn't be registered\r\n" );
            }

            /* re-subscribe to topics led topics */
            xi_subscribe( in_context_handle, gGreenLedTopicName, XI_MQTT_QOS_AT_MOST_ONCE,
                          onLedTopic, ( void* )&gGreenLed );
            xi_subscribe( in_context_handle, gOrangeLedTopicName,
                          XI_MQTT_QOS_AT_MOST_ONCE, onLedTopic, ( void* )&gOrangeLed );
            xi_subscribe( in_context_handle, gRedLedTopicName, XI_MQTT_QOS_AT_MOST_ONCE,
                          onLedTopic, ( void* )&gRedLed );

            /* re-enable the button interrupts */
            Button_IF_EnableInterrupt( SW2 | SW3 );

            break;
        case XI_CONNECTION_STATE_CLOSED:
            UART_PRINT( "connection closed - reason %d!\n", state );

            /* cancel timed task - we don't want to send messages while the library not
             * connected */
            xi_cancel_timed_task( gSendTempratureHandle );
            gSendTempratureHandle = XI_INVALID_TIMED_TASK_HANDLE;

            /* disable button interrupts so the messages for button push/release events
             * won't be sent */
            Button_IF_DisableInterrupt( SW2 | SW3 );

            /* check if the close was due to the user's request */
            if ( XI_STATE_OK == state )
            {
                xi_events_stop();
            }
            else
            {
                waitForWlanEvent();

                xi_connect_to( in_context_handle, conn_data->host, conn_data->port,
                               conn_data->username, conn_data->password,
                               conn_data->connection_timeout,
                               conn_data->keepalive_timeout, conn_data->session_type,
                               &on_connected );
            }
            return;
        default:
            UART_PRINT( "invalid parameter %d\n", conn_data->connection_state );
            return;
    }
}

/**
 * @brief Driver for the xively library logic
 *
 * It initialises the library, creates a context and starts the internal event dispatcher
 * and event processing of xively library.
 *
 * This function is blocking for the sakness of this demo application however it is
 * possible to run xively's event processing with limit of iterations.
 */
void ConnectToXively()
{
    /* Register Push Button Handlers */
    Button_IF_Init( pushButtonInterruptHandlerSW2, pushButtonInterruptHandlerSW3 );

    // Make the buttons to react on both press and release events
    MAP_GPIOIntTypeSet( GPIOA1_BASE, GPIO_PIN_5, GPIO_BOTH_EDGES );
    MAP_GPIOIntTypeSet( GPIOA2_BASE, GPIO_PIN_6, GPIO_BOTH_EDGES );

    // Disable the interrupt for now
    Button_IF_DisableInterrupt( SW2 | SW3 );

    xi_state_t ret_state = xi_initialize( "account_id", "xi_username", 0 );

    if ( XI_STATE_OK != ret_state )
    {
        printf( "xi failed to initialise\r\n" );
        return;
    }

    gXivelyContextHandle = xi_create_context();

    if ( XI_INVALID_CONTEXT_HANDLE == gXivelyContextHandle )
    {
        printf( " xi failed to create context, error: %d\n", -gXivelyContextHandle );
        return;
    }

    xi_state_t connect_result = xi_connect_to(
        gXivelyContextHandle, "broker.dev.xively.io", 8883, XIVELY_DEVICE_ID,
        XIVELY_DEVICE_PASSWORD, 10, 0, XI_SESSION_CLEAN, &on_connected );

    /* start processing xively library events */
    xi_events_process_blocking();

    /* when the event dispatcher is stop destroy the context */
    xi_delete_context( gXivelyContextHandle );

    /* shutdown the xively library */
    xi_shutdown();
}

/**
 * @brief Function that is required by TLS library to track the current time.
 */
time_t XTIME( time_t* timer )
{
    return xi_bsp_time_getcurrenttime_seconds();
}

/**
 * @brief Function required by the TLS library.
 */
uint32_t xively_ssl_rand_generate()
{
    return xi_bsp_rng_get();
}

/******************************************************************************/
/* END OF XIVELY CODE */
/******************************************************************************/

//*****************************************************************************
// SimpleLink Asynchronous Event Handlers -- Start
//*****************************************************************************

//*****************************************************************************
//
//! \brief The Function Handles WLAN Events
//!
//! \param[in]  pWlanEvent - Pointer to WLAN Event Info
//!
//! \return None
//!
//*****************************************************************************
void SimpleLinkWlanEventHandler( SlWlanEvent_t* pWlanEvent )
{
    if ( !pWlanEvent )
    {
        return;
    }

    switch ( pWlanEvent->Event )
    {
        case SL_WLAN_CONNECT_EVENT:
        {
            SET_STATUS_BIT( g_ulStatus, STATUS_BIT_CONNECTION );

            //
            // Information about the connected AP (like name, MAC etc) will be
            // available in 'slWlanConnectAsyncResponse_t'
            // - applications can use it if required
            //
            //  slWlanConnectAsyncResponse_t *pEventData = NULL;
            // pEventData = &pWlanEvent->EventData.STAandP2PModeWlanConnected;
            //

            // Copy new connection SSID and BSSID to global parameters
            memcpy( g_ucConnectionSSID,
                    pWlanEvent->EventData.STAandP2PModeWlanConnected.ssid_name,
                    pWlanEvent->EventData.STAandP2PModeWlanConnected.ssid_len );
            memcpy( g_ucConnectionBSSID,
                    pWlanEvent->EventData.STAandP2PModeWlanConnected.bssid,
                    SL_BSSID_LENGTH );

            UART_PRINT( "[WLAN EVENT] STA Connected to the AP: %s , "
                        "BSSID: %x:%x:%x:%x:%x:%x\n\r",
                        g_ucConnectionSSID, g_ucConnectionBSSID[0],
                        g_ucConnectionBSSID[1], g_ucConnectionBSSID[2],
                        g_ucConnectionBSSID[3], g_ucConnectionBSSID[4],
                        g_ucConnectionBSSID[5] );
        }
        break;

        case SL_WLAN_DISCONNECT_EVENT:
        {
            slWlanConnectAsyncResponse_t* pEventData = NULL;

